{
  "records": [
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-01",
      "title": "The Night Land",
      "type": "Adventure Record",
      "tier": 1,
      "ordinal": 1,
      "notes": {
        "game": "Arriving at the Mournland salvage outpost of Salvation, your party undertook three separate quests into the \"Gray.\" In doing so, you discovered the existence of an Emerald Claw spy inside the settlement."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "10 gp from Belaluur for rescuing Garundah (5 gp if she died).",
            "10 gp from Whist's crew for saving their lives.",
            "10 gp from Evanazer for scouting the tunnel."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A vial of antitoxin for recovering the Arrow of Truth.",
            "A flask of alchemist's fire for recovering the Arrow of Truth.",
            "20 silver arrows for recovering the Arrow of Truth.",
            "25 gp for bringing Whist to judgement."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Grateful Goblin",
            "description": "You saved the goblin Garundah, and she is eternally grateful. At the end of this adventure, choose one of the following benefits:",
            "radios": [
              "Copy a 1st-level wizard spell from legal sources into your spellbook, ritual book, or Book of Shadows at no cost.",
              "Gain fluency in Goblin.",
              "Take an extra 10 gp in treasure."
            ]
          },
          {
            "title": "Stay of Execution",
            "description": "You freed the changeling thief Whist, allowing her to escape justice for her crimes.",
            "checkboxes": [
              "You can call on Whist once in a future adventure to disguise you with her disguise kit. If so, she scores a 22 on her disguise kit check. You must have at least 8 hours free to call on Whist's aid."
            ]
          },
          {
            "title": "Powerful Enemy",
            "description": "You have made an enemy of the powerful and wealthy salvage broker Irullan Karnach. You find that life has gotten harder and items more expensive. At the end of this adventure, roll a d20 and consult the chart below. You may add your Charisma modifier to the result:",
            "table": [
              "<b>Less than 5:</b> Remove 10 gp from your gold total, as Irullan tells her network of vendors to charge more for your necessities.",
              "<b>6 - 13:</b> Remove 5 gp from your gold total, as Irullan tells her network of vendors to charge more for your necessities.",
              "<b>19+:</b> You find vendors in town who don't like Irullan, and they sympathize with you and give you discounts. Add 10 gp to your gold total."
            ]
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-02",
      "title": "Voice in the Machine",
      "type": "Adventure Record",
      "tier": 1,
      "ordinal": 2,
      "notes": {
        "game": "You entered the Mournland to track down the Gray Dogs, a missing salvage crew. When you found them, you uncovered a strange relic from a basement in Kalazart--the <i>Oracle of War</i>. This artifact provided tactical assistance that helped your group escape when you were surrounded by warforged outlaws."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "50 gp from Belaluur for rescuing the Gray Dogs or returning to Salvation with their gear. You <b>must</b> return to Salvation to claim this reward."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A <i>potion of healing</i> from the corpse in Carpet Realm (area 2).",
            "25 gp for ransacking Dragon's Hoard (area 4).",
            "A <i>rope of climbing</i> for defeating the raiders in Musk (area 9).",
            "A suit of <i>mithral chain mail</i> for defeating the iron juggernaut.",
            "A <i>potion of clairvoyance</i> from Garundah if she is still alive."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "A Friend Indeed",
            "description": "You listened to Kalli Alran (or the NPC friend you created during DDAL-EB-01 <i>The Night Land</i> and went back to save her trapped comrade. At the end of this adventure, choose one of the following benefits:",
            "radios": [
              "Your friend applies a temporary enhancement to your armor, granting you +1 AC for the duration of your next adventure.",
              "Your firend gives you a <i>potion of healing<i>."
            ]
          },
          {
            "title": "Hard Call",
            "description": "You angered Kalli Alran (or the NPC friend you created during DDAL-EB-01 <i>The Night Land</i>) by not risking your lives to save her trapped comrade. At the end of this adventure, each surviving member of the Gray Dogs--apart from your friend--slips you 5 gp as thanks."
          },
          {
            "title": "White Rose",
            "description": "You fround a preserved white rose in the same marketplace that you found the <i>Oracle of War<i>.",
            "checkboxes": [
              "Tick this if you identified the rose. At the end of the adventure, you can spend 5 gp to identify it as a rare Orioth rose from the distant jungle of Dajar Orioth in the elven nation of Aerenal."
            ]
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-03",
      "title": "Where the Dead Wait",
      "type": "Adventure Record",
      "tier": 1,
      "ordinal": 3,
      "notes": {
        "game": "You were traveling back through the Mournland with the Gray Dogs, a rescued salvage crew, when you were ambushed by a large force of undead and forced to seek refuge in an abandoned cottage. During the siege, the strage artifact known as the <i>Oracle of War</i> malfunctioned and revealed a verse from the Draconic Prophecy. Realizing the value of the device, the Gray Dogs tried to steal it from under your noses."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "25 gp as a bonus from Salvation's brokers for returning home alive."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "25 gp from the purse in the office (area 4).",
            "A bag of ball bearings, two bags of caltrops, two hunting traps, two vials of acid, and a flask of alchemist's fire from the storage closet (area 5).",
            "A hand crossbow and thirty silvered crossbow bolts from the hidden compartment in the outhouse (area 7).",
            "50 gp from the purse in the cellar (area 8).",
            "An <i>armblade</i> for defeating Jagged the warforged wight (see <i>Eberron: Rising from the Last War</i>)."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Stolen Artifact",
            "description": "A group of scavengers stole the <i>Oracle of War</i> from you. If you play DDAL-EB-04 <i>The Third Protocol</i>, you start that adventure without the Oracle. You recover the artifact for Tiers 2 - 4."
          },
          {
            "title": "Turned Traitor",
            "description": "Your ally Kalli Alran (or the friend you created in DDAL-EB-01 <i>The Night Land</i>) betrayed you to steal the <i>Oracle of War</i>. If they escaped alive, they may show up again in future adventures.",
            "checkboxes": [
              "If you appeal to your ally by writing an in-character letter of 300 words or more, and hand it in to your DM for approval before playing DDAL-EB-04 <i>The Third Protocol</i>, your ally may have second thoughts . . ."
            ]
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-04",
      "title": "The Third Protocol",
      "type": "Adventure Record",
      "tier": 1,
      "ordinal": 4,
      "notes": {
        "game": "Shortly after you returned to the salvage outpost of Salvation, a group of assassins arrived to claim the <i>Oracle of War</i> from your party. You defeated them but learned that powerful forces are hunting for the <i>Oracle</i>."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "100 gp from Saal Dreadstroke's satchel.",
            "The <i>Oracle Detector</i>. This device emits a low beep when pointed in the direction of the <i>Oracle of War</i>. It has an additional minor magical property: it amplifies its vearer's voice, making it sound up to ten times louder than normal. This item doesn't count toward a character's magic item limit."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "Chain mail for looting the blacksmith (area 6).",
            "50 gp for helping the guest in the Salvation Hotel (area 7).",
            "Any three items from the following list for looting the blacksmith (area 6): longsword, shield, light hammer, mace, greatsword, warhammer, chain (50 feet), caltrops (box of 100), flask of alchemist's fire.",
            "A <i>potion of healing</i> and an <i>oil of slipperiness</i> for visiting the apothecary (area 14).",
            "A vial of acid and a vial of basic poison for visiting the apothecary (area 14).",
            "A <i>circlet of blasting</i> for visiting Erix Thorn the provisioner (area 10)."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Captured Assassin",
            "description": "You captured Saal Dreadstroke or some of his cronies alive. Now you must decide what to do with them.",
            "radios": [
              "Turn them over to the Brelish authorities and gain 20 gp per captive.",
              "Hold on to them in the hope that they could be useful. After each adventure that they remain in captivity, you must pay 3 gp per captive on supplies."
            ]
          },
          {
            "title": "Still Alive",
            "description": "Despite all the horrors you've seen, your friend Kalli (or the replacement you made for this character during DDAL-EB-01 <i>The Night Land</i>) remains alive and on your side. What does she do next?",
            "radios": [
              "Kalli heads to Morgrave University in Sharn to investigate the <i>Oracle of War</i>.",
              "Kalli remains in Salvation and tries to set herself up as a salvage broker."
            ]
          }
        ]
      }
    },
    {
      "record": "epic",
      "isForEpic": true,
      "code": "ddal-ebep-01",
      "title": "The Iron Titan",
      "type": "Adventure Record",
      "tier": 1,
      "ordinal": 5,
      "notes": {
        "game": "You helped the brokers of Salvation save the outpost from Big Moe, a warforged colossus awakened by the Order of the Emerald Claw."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(<b>Important:</b> If you forgo advancement from an EPIC, you still gain all of the following rewards.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "200 gp from the brokers of Salvation for defending the outpost.",
            "A <i>potion of healing</i> from the brokers for defending Salvation."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "<i>Rope of climbing</i>",
            "<i>+1 shield</i>",
            "<i>Lantern of revealing</i>"
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Fallen Titan",
            "description": "The forces of Salvation defeated the warforged colossus Big Moe. One of the salvage brokers, Irullan Karnach, fled town just before the attack. Chould she have been involved somehow?",
            "checkboxes": [
              "If you're interested in tailing Karnach, your group can invest 200 gp after this adventure to hire a House Medani inquisitive to track her down. Your contact, Ivelo d'Medani, discovers a lead that she's headed to Sharn. If you visit Sharn in a future adventure, you can locate Ivelo for more information."
            ]
          },
          {
            "title": "Death is a Door",
            "description": "You died defending Salvation from its enemies. Mysterious forces brought you back to life, but you don't know who they were or how they wielded such powerful magic."
          },
          {
            "title": "Enmity of the Claw",
            "description": "You captured a battle standard carried by an undead minion of the Emerald Claw. Your actions have been noted by the Order and they've vowed to punish you in the future."
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-05",
      "title": "A Century of Ashes",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 6,
      "notes": {
        "game": "You traveled to Sharn to seek information about the <i>Oracle of War</i> from the sages at Morgrave University. You helped the sage  Zell Mar overcome his nerves during dinner, and made contact with the sphinx Flamewind to learn more about the Draconic Prophecy. In doing so, you learned that you are not the only ones searching for answers about the device . . ."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "150 gp for defeating Andhedra the rakshasa."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A <i>potion of poison</i> for defeating Andhedra the rakshasa.",
            "A <i>dust of disappearance</i> for defeating Andhedra the rakshasa.",
            "A pair of <i>sending stones</i> for helping Zell impress Jia."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Stakeout",
            "description": "The inquisitve you hired to locate Irullan Karnach after DDAL-EBEP-01 <i>The Iron Titan</i> has tailed her to an apartment in Sharn and is monitoring her movements. He'll keep you appraised of any developments."
          },
          {
            "title": "Love Cats",
            "description": "With your assistance, Zell Mar impressed Jia during dinner. At the end of this adventure, you go carousing with Zell and Jia in the bars of Sharn. Roll a d6 and consult the chart below:",
            "table": [
              "<b>1 - 2:</b> You got into a fight and made an enemy who may cause trouble for you in the future.",
              "<b>3:</b> You found love! You are now dating someone.",
              "<b>4:</b> You gambled and earned 50 gp.",
              "<b>5 - 6:</b> You saved a couple from muggers. Start the next adventure with one extra hero point."
            ]
          },
          {
            "title": "Maker's Mark",
            "description": "Zell Mar identified the missing dwarf Sulring Mroranon as the creator of the <i>Oracle of War</i>.",
            "checkboxes": [
              "At the end of this adventure, your group can choose to spend 150 gp to trace Sulring's family and learn of his whereabouts on the Day of Mourning. This information becomes important in DDAL-EB-08 <i>Parliament of Gears</i>."
            ]
          },
          {
            "title": "Crystal Skull",
            "description": "You learned from the surviving members of Graystrife that Irullan Karnach stole a crystal kull from them that has the power to bring the dead back to life."
          },
          {
            "title": "Flamewind's Favored",
            "description": "You impressed the sphinx Flamewind with your performance during a duel."
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-06",
      "title": "The Last Word",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 7,
      "notes": {
        "game": "The sphinx  Flamewind deciphered the prophecy spoken by the <i>Oracle of War</i> and sent you to Wroat to foil a Thranish spy's strike against the King's Dark Lanterns. You infiltrated a royal armistice ball to idenify the spy and uncover their mission."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "250 gp from Flamewind for identifying the spy (regardless of the success or failure of the spy's mission)."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "100 gp and a <i>potion of healing</i> for defeating Decius and Daykar.",
            "A <i>+1 weapon</i> from Flamewind for identifying the spy (regardless of the success or failure of the spy's mission).",
            "A <i>ring of evasion</i> from Orsino for helping him.",
            "A <i>wand of fear</i> for defeating Idiga Mol Doras."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Dark Lanterns Flicker",
            "description": "Mercutia ir'Gontarli was assassinated during the ball. The city of Wroat is put on high alert as rumors swirl about who could be responsible. This event has repercussions later in the campaign."
          },
          {
            "title": "Silver Torch Extinguished",
            "description": "Oliviér ir'Volett was exposed during the ball as a spy and assassin and paid the ultimate price. As the authorities trace his steps, word spreads that the nation of Thrane could be responsible for the killing. This event has repercussions later in the campaign."
          },
          {
            "title": "Runaway Lovers",
            "description": "You help Orsino and Cesaria escape to build new lives for themselves. They are forever grateful for your assistance.",
            "checkboxes": [
              "Once only, during any adventure in the <i>Oracle of War</i> campaign, you can call on Orsino for assistance. You must have at least 8 hours free to contact him. Orsino's spy network can answer three questions for you, as per the <i>commune</i> spell. When you use this legacy event, all players in your group must remove it from their Adventure Records."
            ]
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-07",
      "title": "Song of the Sky",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 8,
      "notes": {
        "game": "You visited Sharn's could district, Skyway, to locate Sky Blue, a thief mentioned in the verse of the Draconic Prophecy spoken by the <i>Oracle of War</i>. You weren't the only ones hunting for her--salvage broker Irullan Karnach had hired a criminal gang to kidnap her. You rescued Sky Blue from the gang and face off against Karnach."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain ONE of the following rewards:",
          "options": [
            "200 gp from Flamewind for bringing Sky Blue to Lareth Hall.",
            "100 gp from Sky Blue for helping her escape the city."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A <i>feather token</i> for winning the steeplechase.",
            "A suit of plate armor for defeating Bugrilda.",
            "5 flasks of alchemist's fire for defeating Snarla and Snagrat.",
            "50 gp for stealing one of Sky Blue's stashes.",
            "A <i>soarsled</i> (see Handout 4)",
            "A <i>necklace of adaptation</i> for defeating Irullan Karnach."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Emerald Claw Captive",
            "description": "You captured Emerald Claw agent Irullan Karnach alive. At the end of this adventure, you must decide what to do with her.",
            "radios": [
              "Hand her over to the Brelish authorities and claim a reward of 100 gp.",
              "Keep her as a captive. While she remains alive, you must pay 10 gp at the end of each adventure to cover the expenses of her incarceration. If you have access to your own prison cell, you can keep her imprisoned for free.",
              "Execute her."
            ]
          },
          {
            "title": "Wing and a Prayer",
            "description": "You left the city with Sky Blue to go in search of her father, who supposedly died during the Last War. Flamewind is unhappy that you defied her and sends spies to locate you.",
            "checkboxes": [
              "At the end of each adventure in this campaign (including this one), your party must succeed on a group DC 10 Wisdom (Insight) check to stay ahead of the sphinx's agents. If your group fails, tick this box and stop making checks. You are now being watched!"
            ]
          },
          {
            "title": "Mark of the Sphinx",
            "description": "You took Sky Blue to the sphinx Flamewind, who gave her a protective amulet to wear. Flamewind has asked you to look after the girl, and promised she'll be in touch."
          },
          {
            "title": "The Show Must Go On",
            "description": "The bard Stormflower helped you save Sky Blue and is now committed to forging your legend in song.",
            "checkboxes": [
              "If you write Stormflower a song of at least three verses and hand it to your DM before playing DDAL-EB-08 <i>Parliament of Gears</i>, Stormflower makes you an honorary member of the Circle of Song: a secret alliance of bards and entertainers."
            ]
          },
          {
            "title": "Flamewind's Favored",
            "description": "You impressed the sphinx Flamewind with your performance during a steeplechase."
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-08",
      "title": "Parliament of Gears",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 9,
      "notes": {
        "game": "One the orders of Captain Alain ir'Ranek of the Brelish flying fortress Argonth, you mounted a rescue mission into the Mournland to retrieve captives taken by warforged raiding parties. What you discovered whas a highly organized military force carrying out the Lord of Blades' orders. Whoever this mysterious leader is, he's given orders to harvest resources and personnel to assist a dwarven artificer under his \"care.\""
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "250 gp from Captain Alain ir'Ranek for attempting to rescue the captives (regardless of success or failure).",
            "A Lamannian flint shard."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A <i>+2 halberd</i> for searching the captain's room (area U3).",
            "An <i>orb of shielding (Lamannian flint)</i> for searching the workship (area M3).",
            "An <i>elemental gem (blue sapphire)</i> if Wooaaii survives.",
            "A <i>potion of healing</i> and 100 gp for searching the stores (area M6).",
            "A <i>potion of healing</i>, a <i>potion of comprehension</i>, a <i>potion of resistance (acid)</i>, or a <i>potion of resistance (lightning)</i> from Kalli Alran."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Beard Braid",
            "description": "Tellarak Natharon, nephew of the <i>Oracle of War</i>'s creator Sulrin Mroranon, gave you a beard braid to identify yourselves to his uncle."
          },
          {
            "title": "Bested Captain Reeve",
            "description": "You fought Captain Reeve of the 1st Mobile Division and lived to tell the tale. Once per adventure in the <i>Oracle of War</i> campaign, you can use this legacy even to gain advantage on an Intimidation or Persuasion check made to interact with a warforged."
          },
          {
            "title": "Eternal Gratitude",
            "description": "You rescued one or more captives from the Blades' <i>Conclave</i>. They won't forget your bravery and go out of their way to repay you. If you rescued any of the captives liste below, you gain their benefits:",
            "checkboxes": [
              "<b>Breyten Bokk d'Orien</b> grants you a single spell component of up to 500 gp in value.",
              "<b>Bunty Griswold</b> leaves your group a legacy in her will. At the start of each Core Storyline adventure in the <i>Oracle of War</i> campaign, roll a d20. On a 1, Bunty dies and each character with this legacy event gains 250 gp. All playes in your group must remove this legacy event from their Adventure Records.",
              "<b>Dabren Ty</b> can silver one of your weapons or up to 20 pieces of ammunition.",
              "<b>Jurian Saal</b> gifts you a <i>potion of healing</i>.",
              "<b>Kronce</b> offers to help you out on a mission. You may call on the <b>veteran</b> to accompany you on any adventure in the <i>Oracle of War</i> campaign. When you use this legacy event, all players in your group must remove it from their Adventure Records.",
              "<b>Larten</b> gives you a map of Cyre which grants you advantage to all Wisdom (Survival) checks made to navigate the Mournland."
            ]
          }
        ]
      }
    },
    {
      "record": "game",
      "isForEpic": false,
      "code": "ddal-eb-09",
      "title": "Lord Bucket",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 10,
      "notes": {
        "game": "In Salvation, you were introduced to the Captain of Argonth, Alain ir'Ranek and his compatriot, Big Bara, leader of Argonth's scouts. Unfortunately, the pleasant meeting was interrupted by General Karol Tyresh, also known as \"Lord Bucket\". After intercepting scouts acting on behalf of the Lord of Blades, you learned of a plot to assault the outpost. After preparing the outpost's defenses, you routed the Lord of Blades' forces and defeated one of his generals, Bastian."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following reward:",
          "selections": [
            "200 gp for defeating Bastian and repelling the remaining warforged loyal to the Lord of Blades."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "a <i>+2 shield</i> for defeating Bastian. The shield bears the faded and defaced heraldry of Karnath.",
            "200 gp for returning at least one of the warforged spies back to Argonth alive.",
            "200 gp for turning in a group of soldiers conspiring against General Tyresh.",
            "200 gp for successfully completing the \"Four Ts\" without angering General Tyresh."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Captured!",
            "description": "You've been captured by the Lord of Blades and taken into the Mournland! You begin the next adventure confined in one of the Lord of Blades' enclaves."
          },
          {
            "title": "Sky Fall",
            "description": "The young thief Sky Blue has been captured by the Lord of Blades! Will you seek her out and free her?"
          },
          {
            "title": "Not This Time, Death",
            "description": "You managed to save General Tyresh from what appears to have been an attempt to assassinate him, perpetrated from someone loyal to Breland. While he's unlikely to publicly acknowledge your bravery, he repays you for it (in private, of course). General Tyresh provides you with 100 gp from his personal coffers in honor of saving his life."
          },
          {
            "title": "Your Face Is Known",
            "description": "You have brought yourself to the Lord of Blades' attention--as a killer of warforged and an obstacle to his plans to form a warforged nation. Who knowns how far across Khorvaire his reach extends . . .?"
          }
        ]
      }
    },
    {
      "record": "game",
      "code": "ddal-eb-10",
      "title": "Judgement of Iron",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 11,
      "notes": {
        "game": "You joined the Brelish Army's assault on Razorcrag, the Lord of Blades' enclave in the Mournland, and rescued Sulring Mroranon, the creator of the <i>Oracle of War</i>. In an act of betrayal by Big Bara, the floating fortress Argonth fell into the Lord of Blades' hands, and you were forced to flee."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following reward:",
          "selections": [
            "200 gp from Captain Alain ir'Ranek for carrying out the mission."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "Flechette's brassbound spellbook for defeating the mage. You gain the Arcane Kinetics legacy event (see Legacy Events).",
            "A silver dagger with a gold knuckle-duster hilt (worth 250 gp) for defeating Zweihander.",
            "A <i>brooch of shielding</i> for defeating Ranseur.",
            "Big Bara's silver medals (worth 200 gp) for defeating the traitor.",
            "A pair of <i>sending stones</i> for defeating the traitor.",
            "A <i>belt of dwarvenkind</i> for rescuing Sulring."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Arcane Kinetics",
            "description": "You defeated the warforged mage Flechette and seized her spellbook. At the end of any core adventure in the <i>Oracle of War</i> campaign, you can gain the following benefit:",
            "checkboxes": [
              "Copy a wizard spell of 5th level or lower from legal sources into your spellbook, ritual book, or Book of Shadows at now cost. You must have the Book of Ancient Secrets invocation to add to your Book of Shadows."
            ]
          },
          {
            "title": "Argonth Survivor",
            "description": "You were there when Argonth fell to the Lord of Blades. Your time on the floating fortress means you're familiar with its layout, attack capabilities, and defenses."
          },
          {
            "title": "Your Face is Known",
            "description": "You defeated the Lord of Blades' lieutenant in sight of him and lived to tell the tale. Next time you might not be so lucky."
          }
        ]
      }
    },
    {
      "record": "extra",
      "code": "ddal00-13",
      "title": "Cold Spell in Frostfell",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 12,
      "notes": {
        "game": "This adventure appears in DDAL00-13 <i>Knuckleheads & Other Such Curiosities: A Travelers' Guide to Icewind Dale</i>.<hr/>You traveled via magical portal to the arctic region of Eberron called the Frostfell. You assisted the Axyaz clan of goliaths in dealing with attacks and magical assault from an ancient temple atop one of the glacial mountains of the Iceworm Peaks. At the top of the mountain within the temple, you traveled to an interdimensional space connecting Eberron to the cold plane of Risia. There, you defeated a creature called Doomever and returned it to Risia, severing its connection to your world."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "50 gp from Belaluur for escorting Garundah to investigate the happenings in the Mournland.",
            "An <i>everbright lantern</i> as a gift from the Axyaz clan."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A <i>+2 longbow</i> after defeating the Risian spirits.",
            "A <i>pearl of power</i> (Lamannian flint) for defeating Doomever.",
            "A <i>potion of invulnerability</i> and 200 gp."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Supporting Leerut",
            "description": "You've brought back to Salvation with you a young goliath warrior named Leerut of Clan Axyaz. While she is strong and capable, her inexperience with the world outside of the Frostfell leaves her vulnerable. You must decide how you are going to help her. Each character must choose for themselves:",
            "radios": [
              "<b>No Help.</b> You have brought her back from the Frostfell, but you leave her to her own devices.",
              "<b>Provide Gold.</b> You give her 25 gp at the end of this adventure, and that helps her get a place to live and the opportunity to maker her own way in Salvation.",
              "<b>Extended Help.</b> At the end of the next 5 adventures, you give Leerut 10 gp, which gives her the best possible chance of making her way successfully into the tough world of Salvation and the Gray."
            ]
          }
        ]
      }
    },
    {
      "record": "epic",
      "code": "ddal-ebep-02",
      "title": "Rolling Thunder",
      "type": "Adventure Record",
      "tier": 2,
      "ordinal": 13,
      "notes": {
        "game": "Working alongside the thief Sky Blue and her awakened seagull companion Earl, you raided the royal lightning rail train <i>Excelsior</i> to steal a top-secret government intelligence dossier on the <i>Oracle of War</i>. If you were successful, your comrades double-crossed you at the last moment and stole the train's entire vault carriage for themselves, yet provided you with the dossier after the event."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(<b>Important:</b> If you forgo advancement from an EPIC, you still gain all the following rewards.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following rewards:",
          "selections": [
            "500 gp for carrying out the mission, paid from the treasure Sky Blue and Earl stole from you. You do not gain this reward if you failed the heist."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "A <i>hat of disguise</i>",
            "A <i>stone of good luck (luckstone)</i>",
            "<i>Boots of speed</i>"
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Death is a Door",
            "description": "You died while trying to rob the royal lightning rail train <i>Excelsior</i>. Mysterious forces brought you back to life, but you don't know who or what they are."
          },
          {
            "title": "Mournland Dossier",
            "description": "You stole a dossier of intelligence on the Mournland, which Sky is convinced can help her find her missing father."
          },
          {
            "title": "<i>Oracle </i>Dossier",
            "description": "You stole a file of top secret intelligence on the <i>Oracle of War</i>. The information held within is encoded and can't be decrypted until you play EB-11: <i>My Undying Heart</i>. While you have this legacy event marked, Sky Blue and Earl cannot appear in EB-08, EB-09, or EB-10."
          },
          {
            "title": "Regicide",
            "description": "Lord Kor ir'Wynarn, the \"King in Green\", brother to King Boranel of Breland, is dead. This event is sure to foment trouble later in the campaign!"
          },
          {
            "title": "Swords of Liberty",
            "description": "You identified the Swords of Liberty as being responsible for the attack on Lord Kor. You may be able to use this information to your advantage in the future."
          }
        ]
      }
    },
    {
      "record": "game",
      "code": "ddal-eb-11",
      "title": "My Undying Heart",
      "type": "Adventure Record",
      "tier": 3,
      "ordinal": 14,
      "notes": {
        "game": "You presented the <i>Oracle of War</i> to the Institute of the Twelve, where it revealed a troubling new verse from the Draconic Prophecy. To learn more, the Twelve sent you to infiltrate an Order of the emerald Claw enclave and capture its leader, the vampire Widmund. Inside the enclave, you discovered evidence that the Emerald Claw were tracking the movements of the Cairdal Knot, a pair of Undying paladins. The paladins plan to unleash a network of sleeper agents known as Stonefire in an effor to steal the <i>Oracle of War</i>. . . ."
      },
      "advancement": {
        "label": "You gain one level for completing this adventure.",
        "footnote": "(If you decline this level, you still record legacy events but cannot claim any rewards or legacy event benefits for this adventure.)"
      },
      "rewards": [
        {
          "instructions": "You gain the following reward:",
          "selections": [
            "<i>+1 armor</i> or <i>+1 barding</i> from the Twelve for completing the mission."
          ]
        },
        {
          "instructions": "Choose ONE bonus reward:",
          "options": [
            "The <i>crystal skull</i> for defeating Widmund.",
            "400 gp and a <i>potion of resistance (fire)</i> for defeating Widmund.",
            "A <i>relic of whispered alarm</i> from the Skull Chamber.",
            "A <i>scroll of protection (undead)</i> for bringing Saal Dreadstroke or his accomplices before the Twelve."
          ]
        }
      ],
      "legacy": {
        "events": [
          {
            "title": "Crystal Skull",
            "description": "Irullan Karnach confessed that she delivered a crystal skull with the power to bring the dead back to life to the Order of the Emerald Claw."
          },
          {
            "title": "Rescued Agent",
            "description": "You freed Leelle d'Jorasco from captivity in the Emerald Claw enclave. She promises to aid you again in the future."
          }
        ]
      }
    }
  ]
}